/*:
 ## 练习：你的早晨
 
  在你早上离开家之前会有很多事情要做。这个练习将帮助你优化你的日常工作。
 
 - callout(练习): 为你每天早上在离开家之前做的每件事情创建一个常量:像`刷牙`，`上传照片`，`选衣服`，`洗澡`，`慢跑`，`做家务` ， 等等。考虑每件事通常需要多少分钟，并将该值赋值给每个常数。
 */
let brushTeeth = 3
//在此处添加更多...
    
//: - callout(练习): 把所有的常量相加，计算出所有事情所需要的总时间。尝试调整值或添加更多事情，直到总时间看起来比较合理。
    
    
    
//: - callout(练习): 再次把这些常量相加，但这次在不同的组进行:一组为你必须要做的事情，另一组为你可能会做的事情。\
//:\
//:如果有的事情你不是必须做，而且也不喜欢做。将这些事情分到第三组去，同时计算第三组所需要的总时间。\
//:\
//:为每个组创建一个新的常量。



/*:
 看看如果你调整不同事情的时间后，你的总时间会发生什么变化。如果你想有更多的时间为你的朋友发消息，那你需要减少多少淋浴的时间？如果你希望用最多的时间做你最喜欢的事情，你还剩下多少时间做其他事情？
 
 多修改几次数字，直到你有一个理想的早晨计划。
*/





//:[上一页](@previous)  |  第13页，共14页  |  [下一页：好名字](@next)
