//: ## 宠物问题
//: 想象一下，你的朋友正在举办一场宠物展会，他需要记录每一种动物在展会中的数量。
//: 你的朋友还需要知道展会上动物的总数，哺乳动物的总数等。
//: 
//: 现在假设你手头上只有一台装着Xcode的笔记本。也许你可以使用playground来帮助你的朋友。
//: 
//: 使用目前为止所学到的内容，你可以使用注释和数字记录每种动物的数量，像这样:
//阿猫的数量
4

//阿狗的数量
5

//乌龟的数量
3
//: 然后你可以将这些数字复制到新的一行，让playground为你做一些计算，像这样:
//动物总数
4 + 5 + 3

//哺乳动物总数
4 + 5
//: - experiment: 一周过去了，你会在展会中得到更多有关宠物的信息。\
//: 更改上面的代码，以便于更新总数。
//: 
//: 例如，另一个人带来了一只狗，将`狗的数量`从`5`更改为`6`，并将`动物总数`和`哺乳动物总数`中的`5`更改为`6`。
//: 
//: 如果有人带来一种新的动物，就像我们计算其他动物数量一样：添加一个新注释（例如`//老鼠的数量`），然后在下一行添加一个数字。同时，不要忘记更新总数。
//: 
//: - 另一个人带来了一只狗。
//: - 其中一只乌龟生病，不会来了。
//: - 另一个人带来了一只猫。
//: - 有人带了一只老鼠（哺乳动物）。
//: 
//: 有更好的方法来解决这个问题吗？想一两分钟，然后让我们继续前进。
//: 
//:
//:[上一页](@previous)  |  第2页，共14页  |  [下一页：宠物问题2](@next)
