/*:
## 隐藏结果栏
  
 你还记得结果栏吗，它一直默默的为你显示计算的答案。 👉 */
 let sum = 1 + 2 + 3 + 4 + 5123
 let product = sum * sum
 
/*:
  本着怀旧编程的精神，你现在需要隐藏结果栏。慢慢的把鼠标往右边缘移动，直到光标变成双头箭头的样子：
 
 ![resize cursor](resize-cursor.png)
 
  然后单击并向右边缘拖动，直到结果栏无法显示计算结果。
 
   ![playgrounds results window hidden](xcode-results-hidden.png)
 
  把结果栏打开关闭几次，这样你以后就记得怎么把它带回来。
 
 - callout(练习):
  更改上面的一些数字。将5更改为23857，将3更改为11，或更改为其他数字。没有结果栏，你只能猜测结果是什么了。
 
  你开始想念结果栏了吗？即使在这个复古的世界中，你仍然有一个强大的工具来查看程序的状态。
 
  转到下一页，控制台要闪亮登场了！✨
 */
//: [上一页](@previous)  |  第3页，共10页  |  [下一页：控制台](@next)
