//: ## 宠物问题2
//: 完成所有的修改后，playground应该看起来像这样:
//狗的数量
6

//猫的数量
5

//乌龟的数量
2

//仓鼠的数量
1

//动物总数
6 + 5 + 2 + 1

//哺乳动物总数
6 + 5 + 1
//: 这种使用playground的方式肯定解决了你朋友的问题。你已经可以跟踪每种动物的数量，动物的总数和哺乳动物的总数。
//:
//: 但是当你在做这个练习的过程中，你可能已经注意到自己很容易犯错误。你必须在多个地方更改数量。如果你忘记在每一个地方更新，你的总数可能就是错的。
//:
//: 你还必须记住每个数字代表的是哪一种动物，如果没有注释标明每个数字的含义，要想正确的计算数量是非常难的。
//: 
//: 编写代码的时候，最重要的事情之一就是起名字，而不是各种天书一样重复的数字。现在，你可以给每个数量起一个名字 - 然后在代码的需要的地方，直接使用名字，而不是谜一般的数字。
//: 
//: 接下来你会学习如何做到这一点。
//:
//:[Previous](@previous)  |  page 3 of 14  |  [Next: Naming Things](@next)
