//: ## Playground是什么?
//: playground是一个给你写代码的地方。而且你每写一行代码，马上就可以看到代码运行的结果，这就是我们常说的所见即所得。一个playground可能含有一些用来说明的文字（比如你现在正在看的这行文字），也含有你可以修改和运行的代码。
//:
//: 你可以写的最简单的代码就是一个数字:
765
//:👆注意看上面的数字有什么不同？
//: 这种格式的文本就是可编辑的代码，你可以修改它，然后注意观察playground发生的变化。
//:
//: 使用减号来代表负数:
-1200+100
/*:
注意看数字如何显示在界面的右侧? 👉
 
这个区域叫做结果栏（results sidebar）。一旦你添加或修改了代码，playground就会运行你的代码，并且把结果更新在结果栏中。
 
 - callout(练习):
    - 点击一行代码，光标就会跟着移动。
    - 随便改几下数字。
    - 另起一行，输入一些新的数字。\
注意观察你每一次的修改，计算的结果都会显示在右侧的结果栏中。
 
下一步，学习如何更好的使用结果栏。
 
 [上一页](@previous)  |  第2页，共7页  |  [下一页: 计算器](@next)
*/
