//: ## Playground是什么?
//: playground是一个写代码的地方，并且所见即所得。一个playground含有一些解释的内容（比如这行文字）和可以你可以修改和运行的代码。
//:
//: 你可以写的最简单的代码就是一个数字:
765
//:👆注意看上面的数字看起来有何不同？
//: 这种格式的文本就是可编辑的代码，你可以修改它，使得一些事情发生。
//:
//: 使用减号来代表负数:
-1200+100
/*:
注意看数字如何显示在界面的右侧? 👉
 
这个区域叫做 _results sidebar_。当您添加或更改代码，playground就会运行你的代码，并且把结果更新在侧边栏中。
 
- 实验:
    - 点击一行代码，光标就会跟着移动。
    - 随便改几下数字。
    - 另起一行，输入一些新的数字。\
注意观察你每一次的修改，计算的结果都会显示在右侧的results sidebar中。
 
下一步，学习如何更好的使用results sidebar。
 
 [Previous](@previous)  |  page 2 of 7  |  [Next: Calculations](@next)
*/
