/*:
 ## 练习: 打鸡血之歌
 
 许多学校都有打鸡血的歌: 学生多少都会学习一些，然后在诸如运动会等这类学校活动中一起大声唱出来。
 
 你决定重写你学校的歌。你要通过代码来编辑歌词，这样你就可以不用一直复制和粘贴重复的那部分歌词。
 
 1. 编辑歌曲，至少有一个重复的`副歌`。
 2. 编辑`副歌`，加入有实际意义的词。
 3. 编辑`副歌`，`schoolName`至少出现两次。
 4. 把校名改为虚构的学校，以此来测试你的代码。\
 
记得使用字符串插值，万一你以后决定把你辉煌的歌词卖给另一所学校呢。
 
 - note:
 使用结果栏中的显示结果按钮，来查看你的工作成果。
 */


let schoolName = "YOUR SCHOOL NAME"
let refrain = "hmm hmm HMMM hm-hmm \(schoolName) hmm hmm HMMMMM"

let song = "\(refrain)\n\(refrain)\nYes, \(refrain)"



//:
//:[上一页](@previous)  |  第15页，共16页 |  [下一页: 练习: 显示值](@next)
