//: ## 程序员间的术语
//: 作为一个App开发人员，不仅是要在Xcode中写代码。还需要经常和其他开发人员一起讨论如何解决问题，沟通需求。因此，了解常用的术语对程序员来说很重要。
//:
//: 在本课程中，你将学习如何编写代码和创建App，你还会了解到与其他开发人员讨论时会用到的一些术语。
//:
//: 你已经在这个playground中学过了常量（constant）和标识符（identifier）。接下来，请仔细看下面的代码，我们要学一些新的术语了。
let numberOfDogs = 101
//: 当你在Swift中定义一个常量时，它被称为申明常量（declaring a constant）。所以上面的代码可以这样读：我声明一个常量`numberOfDogs`，它的值为`101`！”。
//:
//: `let`这个词是一个关键字（keyword）。关键字在Swift中有特殊含义。关键字不能用作常量的名字。 `let`关键字用于声明一个常量。在后面的课程里，我们将介绍更多Swift的关键字。
//:
//: 上面代码中的`= 101`是在给一个常量分配值。这称为赋值（assignment），等号`=`称为赋值操作（assignment operator）。
//:
//: - note: 不要想着马上记住每个新术语。你将在课程的后续部分看到这些术语，如果你需要复习术语，则可以在“学生指南”的词汇表中找到它们。
//:
//:[上一页](@previous)  |  第8页，共14页  |  [下一页：总结](@next)
